## Column selection

In [32]:
df.var1

0    0
1    4
2    8
3    5
4    1
Name: var1, dtype: int32

In [33]:
df[["var1", "var2"]]

   var1  var2
0     0     2
1     4     9
2     8     7
3     5     6
4     1     1

In [34]:
type(df.var1)

pandas.core.series.Series

In [35]:
type(df)

pandas.core.frame.DataFrame

## creating new column

In [36]:
df["new"] = df.var1 + df.var2
df

   var1  var2  var3  new
0     0     2     2    2
1     4     9     6   13
2     8     7     6   15
3     5     6     5   11
4     1     1     4    2

### drop the column

In [37]:
df.drop("new", axis=1, inplace =True)
df

   var1  var2  var3
0     0     2     2
1     4     9     6
2     8     7     6
3     5     6     5
4     1     1     4

### drop the row

In [38]:
df.drop(labels = 4, inplace =True)
df

   var1  var2  var3
0     0     2     2
1     4     9     6
2     8     7     6
3     5     6     5

### selecting rows

In [39]:
df.loc[0]

var1    0
var2    2
var3    2
Name: 0, dtype: int32

In [40]:
df.iloc[0]

var1    0
var2    2
var3    2
Name: 0, dtype: int32

selecting subset of columns

In [41]:
df.loc[0, "var1"]

0

In [44]:
df.loc[[0,2], ["var1","var2"]]

   var1  var2
0     0     2
2     8     7

In [49]:
df.index =["a", "b", "c", "d"]
df

   var1  var2  var3
a     0     2     2
b     4     9     6
c     8     7     6
d     5     6     5

resetting index

In [52]:
df.reset_index(inplace = True)
df

  index  var1  var2  var3
0     a     0     2     2
1     b     4     9     6
2     c     8     7     6
3     d     5     6     5

setting index

In [55]:
newin = "CA NY WY OR".split()
newin

['CA', 'NY', 'WY', 'OR']

In [58]:
df["States"] = newin
df

  index  var1  var2  var3 States
0     a     0     2     2     CA
1     b     4     9     6     NY
2     c     8     7     6     WY
3     d     5     6     5     OR

In [59]:
df.set_index("States")

       index  var1  var2  var3
States
CA         a     0     2     2
NY         b     4     9     6
WY         c     8     7     6
OR         d     5     6     5

multi index method

In [66]:
# index levels
outside = ["G1","G1","G1","G2","G2","G2"]
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [61]:
zip(outside, inside)

In [62]:
list(zip(outside, inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [68]:
hier_index = pd.MultiIndex.from_tuples(hier_index )
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [63]:
# pd.MultiIndex

In [65]:
arr = np.array([[1,1,2,2], ["red", "blue", "red", "blue"]])
arr
pd.MultiIndex.from_arrays(arr)

MultiIndex([('1',  'red'),
            ('1', 'blue'),
            ('2',  'red'),
            ('2', 'blue')],
           )

In [69]:
outside = ["G1","G1","G1","G2","G2","G2"]
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [70]:
df = pd.DataFrame(randn(6,2), hier_index)

In [71]:
outside = ["G1","G1","G1","G2","G2","G2"]
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [72]:
df = pd.DataFrame(randn(6,2), hier_index, ["A", "B"])

In [73]:
df

             A         B
G1 1  0.749729  0.989920
   2  0.944052  0.255227
   3 -0.067854  1.165036
G2 1 -0.767479  0.132121
   2 -0.472565  0.495372
   3 -0.160067  0.038913

In [76]:
df.index.names = ["Groups", "Nums"]

In [77]:
df

                    A         B
Groups Nums
G1     1     0.749729  0.989920
       2     0.944052  0.255227
       3    -0.067854  1.165036
G2     1    -0.767479  0.132121
       2    -0.472565  0.495372
       3    -0.160067  0.038913

cross section function

In [78]:
df.xs("G1")

             A         B
Nums
1     0.749729  0.989920
2     0.944052  0.255227
3    -0.067854  1.165036

In [79]:
df.xs(1, level="Nums")

               A         B
Groups
G1      0.749729  0.989920
G2     -0.767479  0.132121

In [80]:
df

                    A         B
Groups Nums
G1     1     0.749729  0.989920
       2     0.944052  0.255227
       3    -0.067854  1.165036
G2     1    -0.767479  0.132121
       2    -0.472565  0.495372
       3    -0.160067  0.038913

## Conditional selection

In [3]:
df=pd.DataFrame({"col1": [1,2,3,4],
                "col2": [444,555,666,444],
                "col3": ["abc", "def", "ghi", "xyz"]})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [4]:
df["col1"]

0    1
1    2
2    3
3    4
Name: col1, dtype: int64

In [5]:
df["col1"]>2#returns boolean values
# df.col1 > 2 # dot notation

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [7]:
df[df.col1 >2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [8]:
df[df.col1 >2]["col1"]

2    3
3    4
Name: col1, dtype: int64

In [9]:
# combining conditions

In [13]:
df[(df["col1"]>2) & (df["col2"]==666)]

   col1  col2 col3
2     3   666  ghi

In [1]:
# example

In [18]:
df = pd.DataFrame({
    "cigarette": (0,5,10,15,np.nan,20),
    "lung_cap": (45,42,np.nan,33,31,29)
})
df
df[df["cigarette"]==5]["lung_cap"]

1    42.0
Name: lung_cap, dtype: float64

**Conditionals [IF / ELSE] in Pandas - create columns based on conditions**

In [2]:
names = "Martin", "Lisa", "Maxwell", "Manju", "Kenneth"
debts = 10,20,30,20,30
df = pd.DataFrame({"names":names, "debts": debts})
df

     names  debts
0   Martin     10
1     Lisa     20
2  Maxwell     30
3    Manju     20
4  Kenneth     30

In [3]:
df["interests"] = [i*0.2 if i<20 else i*0.4 for i in df.debts]

In [4]:
df

     names  debts  interests
0   Martin     10        2.0
1     Lisa     20        8.0
2  Maxwell     30       12.0
3    Manju     20        8.0
4  Kenneth     30       12.0

In [9]:
titanic= pd.read_csv("C:/Users/Owner/titanic.csv")
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [11]:
type(titanic["Age"])

pandas.core.series.Series

In [12]:
titanic["Age"].shape

(891,)

In [13]:
titanic[["Age","Sex"]].head()

    Age     Sex
0  22.0    male
1  38.0  female
2  26.0  female
3  35.0  female
4  35.0    male

In [14]:
above35 = titanic["Age"]>35
above35.head()

0    False
1     True
2    False
3    False
4    False
Name: Age, dtype: bool

In [17]:
titanic[titanic["Age"]>35].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S

In [16]:
titanic.shape

(891, 12)

In [81]:
df = pd.DataFrame(data= [[1,2,3,4],[5,6,7,8], [9,10,11,12], [13,14,15,16]], index = ["a","b","c","d"], columns = ["ahmet", "mehmet", "veli", "hasan"])

In [82]:
df

   ahmet  mehmet  veli  hasan
a      1       2     3      4
b      5       6     7      8
c      9      10    11     12
d     13      14    15     16

In [89]:
df.assign(orhan=[3,6,9,12])

   ahmet  mehmet  veli  hasan  orhan
a      1       2     3      4      3
b      5       6     7      8      6
c      9      10    11     12      9
d     13      14    15     16     12

In [90]:
df

   ahmet  mehmet  veli  hasan
a      1       2     3      4
b      5       6     7      8
c      9      10    11     12
d     13      14    15     16

In [92]:
new = {"ahmet":11, "mehmet":12, "veli":13, "hasan":14}

In [93]:
df = df.append(new, ignore_index=True)

In [94]:
df

   ahmet  mehmet  veli  hasan
0      1       2     3      4
1      5       6     7      8
2      9      10    11     12
3     13      14    15     16
4     11      12    13     14

In [95]:
df = pd.DataFrame([[1,2], [4,5], [7,8]], index = ["kobra viper sidewinder".split()], columns = ["max_speed", "shield"])

In [96]:
df = pd.DataFrame({'var_1':['a','b','c'], 'var_2':[1, 2, 3], 'var_3':['apple', 'banana', 'pear']})
df
cols = ['var_1', 'var_2']    # Set columns to combine
df['combined'] = df[cols].apply(lambda row: ', '.join(row.values.astype(str)), axis=1)
# Define which column is index
df_i = df.set_index('combined') 
# Set the index to None
df_i.index.names = [None] 
df

  var_1  var_2   var_3 combined
0     a      1   apple     a, 1
1     b      2  banana     b, 2
2     c      3    pear     c, 3